<a href="https://colab.research.google.com/github/Nashra-Tazmeen/Daily_learnings/blob/main/D_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


-- create
CREATE TABLE CUSTOMERS (
  customer_id INTEGER PRIMARY KEY,
  name TEXT NOT NULL,
  address TEXT NOT NULL,
  age INTEGER
);
CREATE TABLE TRANSACTIONS (
  transaction_id INTEGER PRIMARY KEY,
  name TEXT NOT NULL,
  address TEXT NOT NULL,
  amount INTEGER ,
  customer_id INTEGER,
  transaction_date DATE,
  transaction_mode TEXT,
  bank_name TEXT,
  FOREIGN KEY (customer_id) REFERENCES CUSTOMERS (customer_id)
);
  


-- insert
INSERT INTO CUSTOMERS (customer_id, name, address, age)
VALUES
(1, 'Alice Johnson', '123 Maple St', 30),
(2, 'Bob Smith', '456 Oak St', 45);


INSERT INTO TRANSACTIONS (transaction_id, name, address, amount, customer_id, transaction_date, transaction_mode, bank_name)
VALUES
(1, 'Alice Johnson', '123 Maple St', 100, 1, '2024-09-01', 'Credit Card', 'Bank of America'),
(2, 'Bob Smith', '456 Oak St', 250, 2, '2024-09-02', 'Debit Card', 'Chase Bank'),
(3, 'Alice Johnson', '123 Maple St', 150, 1, '2024-09-01', 'Debit Card', 'Bank of America'),
(4, 'Alice Johnson', '123 Maple St', 50, 1, '2024-09-01', 'Cash', 'Bank of America');

WITH RankedTransactions AS (
    SELECT
        *,
        ROW_NUMBER() OVER (PARTITION BY customer_id, transaction_date ORDER BY transaction_id) AS rn
    FROM TRANSACTIONS
)
SELECT
    *
FROM RankedTransactions
WHERE rn = 1;